<?php

declare(strict_types=1);

/** @var \Yiisoft\View\WebView $this */

$this->setTitle('About');
?>

<div>
    <h3> Что такое Yii ?</h3>

    <p>
        Yii – это высокопроизводительный компонентный PHP фреймворк, предназначенный для быстрой разработки современных
        веб-приложений. Слово Yii (произносится как Йи [ji:]) в китайском языке означает «простой и эволюционирующий».
        Также Yii может расшифровываться как акроним Yes It Is!
    </p>

    <h3 class='mt-3'>Для каких задач больше всего подходит Yii ?</h3>

    <p>
        Yii – это универсальный фреймворк и может быть задействован во всех типах веб-приложений. Благодаря его
        компонентной структуре и отличной поддержке кэширования, фреймворк особенно подходит для разработки таких крупных
        проектов, как порталы, форумы, CMS, магазины или RESTful-приложения.
    </p>

    <h3 class='mt-3'>Как я могу сотрудничать ?</h2>

    <p>
        Вы можете найти исходный код Yii по адресу <a href='https://github.com/yiisoft' target='_blank'>GitHub</a> и вы
        можете сотрудничать внося свой вклад в решение проблем каждого хранилища. Вы также можете найти официальную
        документацию по адресу <a href='https://github.com/yiisoft/docs' target='_blank'>Документация Yii</a>.
    </p>

    <h3 class='mt-3'>Пожертвовать ?</h3>

    <p>
        Пожертвование - это отличный способ увеличить темпы разработки и поддержать членов основной команды. Средства
        будут потрачены на:<br><br>

            - Дополнительное время на Yii для основных разработчиков. <br>
            - Серверы и инфраструктура. <br>
            - Инструменты разработки. <br>
            - Дизайн. <br>
            - Маркетинг. <br>

        <br><strong>В настоящее время доступны такие услуги по пожертвованию:</strong><br><br>

        OpenCollective: <a href='https://opencollective.com/yiisoft' target='_blank'>https://opencollective.com/yiisoft</a><br>
        Github спонсоры: <a href='https://github.com/sponsors/yiisoft' target='_blank'>https://github.com/sponsors/yiisoft</a><br>
        Boosty для российского пользователя: <a href='https://boosty.to/yiisoft' target='_blank'>https://boosty.to/yiisoft</a><br>
    </p>
</div>
